Archivers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-10 Sat 11:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Information theory: HW #3 solution</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Volkhov Mikhail, M3338" />
</head>
<body>
<div id="content">
<h1 class="title">Information theory: HW #3 solution</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Task objectives, format, prerequisites</a></li>
<li><a href="#orgheadline2">2. Two-pass huffman coding</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Task objectives, format, prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
So the task is to implement several algorithms of data compression
and provide reports on them. Reports will contain logs from
algorithms that will show how it operates this data. Tables with
explanation will be attached. I won't attach haskell snippets this
time as they became really big and complex. Instead, i'll put a
separate pdf with all the code separately. <b>TODO</b>
</p>

<p>
Proverb correspondent to my task is the following:
</p>

<blockquote>
<p>
<i>Love the heart that hurts you, but never hurt the heart that loves you.</i>
</p>
</blockquote>

<p>
It's in english that's why i'll stick to utf-8/ascii encoding as
byte representation. It contains \(71\) letters, so in general it's
\(568\) bytes if used without any coding.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Two-pass huffman coding</h2>
<div class="outline-text-2" id="text-2">
<p>
I've implemented regural huffman coding, as it can be seen from the
first table: code words of the same length are sorted
lexicographically:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" style="line-height: 7px; margin-left: 15px;">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Char</th>
<th scope="col" class="org-right">Code Word</th>
<th scope="col" class="org-right">Freq</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">00</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-right">010</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-right">011</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-right">100</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-right">1010</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-right">1011</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-right">11000</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-right">11001</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-right">11010</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">11011</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-right">11100</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-right">111010</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-right">111011</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-right">111100</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-right">111101</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">L</td>
<td class="org-right">111110</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-right">111111</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
And the second pass completes encoding:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" style="line-height: 7px; margin-left: 15px;">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">\(C\)</th>
<th scope="col" class="org-left">\(P(C)\)</th>
<th scope="col" class="org-right">\(Codeword\)</th>
<th scope="col" class="org-right">\(L(S)\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">L</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111110</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11100</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">3 / 71</td>
<td class="org-right">11010</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">27</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11011</td>
<td class="org-right">43</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1010</td>
<td class="org-right">47</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">50</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">52</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">55</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">58</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11011</td>
<td class="org-right">63</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">66</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">68</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">71</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1011</td>
<td class="org-right">75</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1010</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">82</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">2 / 71</td>
<td class="org-right">11000</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">89</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">2 / 71</td>
<td class="org-right">11001</td>
<td class="org-right">94</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11100</td>
<td class="org-right">99</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1011</td>
<td class="org-right">103</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111010</td>
<td class="org-right">109</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">111</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111111</td>
<td class="org-right">117</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1011</td>
<td class="org-right">121</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">124</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">126</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111101</td>
<td class="org-right">132</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">135</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">3 / 71</td>
<td class="org-right">11010</td>
<td class="org-right">140</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">143</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1010</td>
<td class="org-right">147</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">149</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">152</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1011</td>
<td class="org-right">156</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1010</td>
<td class="org-right">160</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">163</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">165</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">168</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">171</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">174</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">176</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">179</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">182</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11011</td>
<td class="org-right">187</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1010</td>
<td class="org-right">191</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">194</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">196</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">199</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">8 / 71</td>
<td class="org-right">011</td>
<td class="org-right">202</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11011</td>
<td class="org-right">207</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">11 / 71</td>
<td class="org-right">100</td>
<td class="org-right">210</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">212</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111100</td>
<td class="org-right">218</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11100</td>
<td class="org-right">223</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">3 / 71</td>
<td class="org-right">11010</td>
<td class="org-right">228</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">8 / 71</td>
<td class="org-right">010</td>
<td class="org-right">231</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">2 / 71</td>
<td class="org-right">11000</td>
<td class="org-right">236</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">13 / 71</td>
<td class="org-right">00</td>
<td class="org-right">238</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">2 / 71</td>
<td class="org-right">11001</td>
<td class="org-right">243</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">4 / 71</td>
<td class="org-right">11100</td>
<td class="org-right">248</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">5 / 71</td>
<td class="org-right">1011</td>
<td class="org-right">252</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">1 / 71</td>
<td class="org-right">111011</td>
<td class="org-right">258</td>
</tr>
</tbody>
</table>

<p>
Encoded proverb encoded is \(l_2 = 258\) bits, while data amount needed to
transfer huffman tree should be calculated manually. First, to
transfer the tree itself, it's sufficient to pass only \(19\) bits
(calculated manually using table 3.3 from the study book).
</p>

\begin{align*}
\lceil\log{\dbinom{256}{1}}\rceil +
\lceil\log{\dbinom{255}{3}}\rceil +
\lceil\log{\dbinom{254}{2}}\rceil +
\lceil\log{\dbinom{253}{5}}\rceil +
\lceil\log{\dbinom{252}{6}}\rceil = 117
\end{align*}

<p>
So totally \(l_1 = 19 + 117 = 136\), and total length is \(l = l_1+l_2 =
  394\) bits. Much better than raw \(568\) bits.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Volkhov Mikhail, M3338</p>
<p class="date">Created: 2016-12-10 Sat 11:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
